"""
Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж) і повертає
генератор, який буде вертати значення з цієї послідовності, при цьому, якщо було повернено останній елемент із
послідовності - ітерація починається знову.
   Приклад (якщо запустили його у себе - натисніть Ctrl+C ;) ):
    for elem in generator([1, 2, 3]):
"""


def generator(iterable):
    while True:
        for elem in iterable:
            yield elem


if __name__ == '__main__':
    for elem in generator(['oh', 'my', 'god', 'why', 'again']):
        print(elem)
